In [1]:
import pandas as pd

In [48]:
df=pd.read_csv(r"C:\Users\sarth\Downloads\AI\housing.csv")

In [5]:
print(df)

       longitude  latitude
0        -122.23     37.88
1        -122.22     37.86
2        -122.24     37.85
3        -122.25     37.85
4        -122.25     37.85
...          ...       ...
20635    -121.09     39.48
20636    -121.21     39.49
20637    -121.22     39.43
20638    -121.32     39.43
20639    -121.24     39.37

[20640 rows x 2 columns]

In [6]:
df=pd.read_excel(r"C:\Users\sarth\Downloads\BTech_Project_Literature_review_new_paper.xlsx")

In [15]:
df=pd.read_csv("https://raw.githubusercontent.com/S1aERT/portfolioumm/refs/heads/main/pima-indians-diabetes.data.txt")

In [16]:
print(df)

      6  148  72  35    0  33.6  0.627  50  1
0     1   85  66  29    0  26.6  0.351  31  0
1     8  183  64   0    0  23.3  0.672  32  1
2     1   89  66  23   94  28.1  0.167  21  0
3     0  137  40  35  168  43.1  2.288  33  1
4     5  116  74   0    0  25.6  0.201  30  0
..   ..  ...  ..  ..  ...   ...    ...  .. ..
762  10  101  76  48  180  32.9  0.171  63  0
763   2  122  70  27    0  36.8  0.340  27  0
764   5  121  72  23  112  26.2  0.245  30  0
765   1  126  60   0    0  30.1  0.349  47  1
766   1   93  70  31    0  30.4  0.315  23  0

[767 rows x 9 columns]

In [17]:
df.head()

   6  148  72  35    0  33.6  0.627  50  1
0  1   85  66  29    0  26.6  0.351  31  0
1  8  183  64   0    0  23.3  0.672  32  1
2  1   89  66  23   94  28.1  0.167  21  0
3  0  137  40  35  168  43.1  2.288  33  1
4  5  116  74   0    0  25.6  0.201  30  0

In [19]:
df.tail()

      6  148  72  35    0  33.6  0.627  50  1
762  10  101  76  48  180  32.9  0.171  63  0
763   2  122  70  27    0  36.8  0.340  27  0
764   5  121  72  23  112  26.2  0.245  30  0
765   1  126  60   0    0  30.1  0.349  47  1
766   1   93  70  31    0  30.4  0.315  23  0

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 767 entries, 0 to 766
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   6       767 non-null    int64
 1   148     767 non-null    int64
 2   72      767 non-null    int64
 3   35      767 non-null    int64
 4   0       767 non-null    int64
 5   33.6    767 non-null    float64
 6   0.627   767 non-null    float64
 7   50      767 non-null    int64
 8   1       767 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [21]:
df.describe()

,6,148,72,35,0,33.6,0.627,50,1
count,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000
mean,3.842243,120.859192,69.101695,20.517601,79.903520,31.990482,0.471674,33.219035,0.348110
std,3.370877,31.978468,19.368155,15.954059,115.283105,7.889091,0.331497,11.752296,0.476682
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243500,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,32.000000,32.000000,0.371000,29.000000,0.000000
75%,6.000000,140.000000,80.000000,32.000000,127.500000,36.600000,0.625000,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [22]:
df.columns

Index(['6', '148', '72', '35', '0', '33.6', '0.627', '50', '1'], dtype='object')

In [23]:
df.shape

(767, 9)

In [32]:
print(df[["6","72"]])

      6  72
0     1  66
1     8  64
2     1  66
3     0  40
4     5  74
..   ..  ..
762  10  76
763   2  70
764   5  72
765   1  60
766   1  70

[767 rows x 2 columns]

In [33]:
df.loc[0]

6         1.000
148      85.000
72       66.000
35       29.000
0         0.000
33.6     26.600
0.627     0.351
50       31.000
1         0.000
Name: 0, dtype: float64

In [34]:
df.iloc[0]

6         1.000
148      85.000
72       66.000
35       29.000
0         0.000
33.6     26.600
0.627     0.351
50       31.000
1         0.000
Name: 0, dtype: float64

In [36]:
print(df.head())

   6  148  72  35    0  33.6  0.627  50  1
0  1   85  66  29    0  26.6  0.351  31  0
1  8  183  64   0    0  23.3  0.672  32  1
2  1   89  66  23   94  28.1  0.167  21  0
3  0  137  40  35  168  43.1  2.288  33  1
4  5  116  74   0    0  25.6  0.201  30  0

In [37]:
df.loc[0,"6"]

1

In [46]:
df.iloc[0:3, 0:2]

   6  148
0  1   85
1  8  183
2  1   89

In [47]:
df[df["6"]<5]

     6  148  72  35    0  33.6  0.627  50  1
0    1   85  66  29    0  26.6  0.351  31  0
2    1   89  66  23   94  28.1  0.167  21  0
3    0  137  40  35  168  43.1  2.288  33  1
5    3   78  50  32   88  31.0  0.248  26  1
7    2  197  70  45  543  30.5  0.158  53  1
..  ..  ...  ..  ..  ...   ...    ...  .. ..
757  1  106  76   0    0  37.5  0.197  26  0
759  2   88  58  26   16  28.4  0.766  22  0
763  2  122  70  27    0  36.8  0.340  27  0
765  1  126  60   0    0  30.1  0.349  47  1
766  1   93  70  31    0  30.4  0.315  23  0

[492 rows x 9 columns]

In [49]:
print(df)

       longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0        -122.23     37.88                41.0        880.0           129.0
1        -122.22     37.86                21.0       7099.0          1106.0
2        -122.24     37.85                52.0       1467.0           190.0
3        -122.25     37.85                52.0       1274.0           235.0
4        -122.25     37.85                52.0       1627.0           280.0
...          ...       ...                 ...          ...             ...
20635    -121.09     39.48                25.0       1665.0           374.0
20636    -121.21     39.49                18.0        697.0           150.0
20637    -121.22     39.43                17.0       2254.0           485.0
20638    -121.32     39.43                18.0       1860.0           409.0
20639    -121.24     39.37                16.0       2785.0           616.0

       population  households  median_income  median_house_value  \
0           322.0       126.0         8.3252            452600.0
1          2401.0      1138.0         8.3014            358500.0
2           496.0       177.0         7.2574            352100.0
3           558.0       219.0         5.6431            341300.0
4           565.0       259.0         3.8462            342200.0
...           ...         ...            ...                 ...
20635       845.0       330.0         1.5603             78100.0
20636       356.0       114.0         2.5568             77100.0
20637      1007.0       433.0         1.7000             92300.0
20638       741.0       349.0         1.8672             84700.0
20639      1387.0       530.0         2.3886             89400.0

      ocean_proximity
0            NEAR BAY
1            NEAR BAY
2            NEAR BAY
3            NEAR BAY
4            NEAR BAY
...               ...
20635          INLAND
20636          INLAND
20637          INLAND
20638          INLAND
20639          INLAND

[20640 rows x 10 columns]

In [53]:
df[(df['longitude']< -122.24) & (df['population']<845)]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
13,-122.26,37.84,52.0,696.0,191.0,345.0,174.0,2.6736,191300.0,NEAR BAY
15,-122.26,37.85,50.0,1120.0,283.0,697.0,264.0,2.1250,140000.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
19802,-123.17,40.31,36.0,98.0,28.0,18.0,8.0,0.5360,14999.0,INLAND
19803,-123.22,40.16,27.0,1848.0,449.0,396.0,150.0,2.8472,41300.0,INLAND
19804,-123.48,40.34,19.0,518.0,108.0,216.0,80.0,2.7083,64500.0,INLAND
19805,-123.43,40.22,20.0,133.0,35.0,87.0,37.0,3.6250,67500.0,INLAND
19806,-123.41,40.07,17.0,449.0,151.0,141.0,53.0,0.8362,87500.0,INLAND

In [54]:
df.query("longitude<-122.24 and population<845")

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
13,-122.26,37.84,52.0,696.0,191.0,345.0,174.0,2.6736,191300.0,NEAR BAY
15,-122.26,37.85,50.0,1120.0,283.0,697.0,264.0,2.1250,140000.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
19802,-123.17,40.31,36.0,98.0,28.0,18.0,8.0,0.5360,14999.0,INLAND
19803,-123.22,40.16,27.0,1848.0,449.0,396.0,150.0,2.8472,41300.0,INLAND
19804,-123.48,40.34,19.0,518.0,108.0,216.0,80.0,2.7083,64500.0,INLAND
19805,-123.43,40.22,20.0,133.0,35.0,87.0,37.0,3.6250,67500.0,INLAND
19806,-123.41,40.07,17.0,449.0,151.0,141.0,53.0,0.8362,87500.0,INLAND

In [55]:
col="longitude"
df.query(f"{col}<-122.24")

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY
7,-122.25,37.84,52.0,3104.0,687.0,1157.0,647.0,3.1200,241400.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
19802,-123.17,40.31,36.0,98.0,28.0,18.0,8.0,0.5360,14999.0,INLAND
19803,-123.22,40.16,27.0,1848.0,449.0,396.0,150.0,2.8472,41300.0,INLAND
19804,-123.48,40.34,19.0,518.0,108.0,216.0,80.0,2.7083,64500.0,INLAND
19805,-123.43,40.22,20.0,133.0,35.0,87.0,37.0,3.6250,67500.0,INLAND
19806,-123.41,40.07,17.0,449.0,151.0,141.0,53.0,0.8362,87500.0,INLAND

In [56]:
df.isnull()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
20635,False,False,False,False,False,False,False,False,False,False
20636,False,False,False,False,False,False,False,False,False,False
20637,False,False,False,False,False,False,False,False,False,False
20638,False,False,False,False,False,False,False,False,False,False
20639,False,False,False,False,False,False,False,False,False,False

In [58]:
df.isnull().sum()

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
dtype: int64

In [59]:
df.dropna()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [65]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "A": [1, np.nan, 3, np.nan, 5],
    "B": [np.nan, 20, np.nan, 40, 50],
    "C": [10, 20, np.nan, np.nan, np.nan],
    "D": [np.nan, np.nan, np.nan, 4, 5]
})

print(df)

     A     B     C    D
0  1.0   NaN  10.0  NaN
1  NaN  20.0  20.0  NaN
2  3.0   NaN   NaN  NaN
3  NaN  40.0   NaN  4.0
4  5.0  50.0   NaN  5.0

In [66]:
df.bfill()

     A     B     C    D
0  1.0  20.0  10.0  4.0
1  3.0  20.0  20.0  4.0
2  3.0  40.0   NaN  4.0
3  5.0  40.0   NaN  4.0
4  5.0  50.0   NaN  5.0

In [68]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [132]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "Alice", "Bob"],
    "Age":  [25, 30, 35, 25, 30],
    "City": ["Delhi", "Mumbai", "Pune", "Delhi", "Mumbai"]
})

print(df)

      Name  Age    City
0    Alice   25   Delhi
1      Bob   30  Mumbai
2  Charlie   35    Pune
3    Alice   25   Delhi
4      Bob   30  Mumbai

In [72]:
df.drop_duplicates()

      Name  Age    City
0    Alice   25   Delhi
1      Bob   30  Mumbai
2  Charlie   35    Pune

In [82]:
print(df)

      Name  Age    City
0    Alice   25   Delhi
1      Bob   30  Mumbai
2  Charlie   35    Pune
3    Alice   25   Delhi
4      Bob   30  Mumbai
5    Alice   35  London

In [86]:
df.duplicated(["Name","Age"])

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [87]:
df['Name'].str.lower()

0      alice
1        bob
2    charlie
3      alice
4        bob
5      alice
Name: Name, dtype: object

In [88]:
df['City'].str.contains('delhi',case=False)

0     True
1    False
2    False
3     True
4    False
5    False
Name: City, dtype: bool

In [89]:
df

      Name  Age    City
0    Alice   25   Delhi
1      Bob   30  Mumbai
2  Charlie   35    Pune
3    Alice   25   Delhi
4      Bob   30  Mumbai
5    Alice   35  London

In [90]:
import pandas as pd

df = pd.DataFrame({
    "Email": [
        "alice@gmail.com",
        "bob@yahoo.com",
        "charlie@outlook.com",
        "david@company.org"
    ]
})

print(df)

                 Email
0      alice@gmail.com
1        bob@yahoo.com
2  charlie@outlook.com
3    david@company.org

In [92]:
df['Email'].str.split('@')

0        [alice, gmail.com]
1          [bob, yahoo.com]
2    [charlie, outlook.com]
3      [david, company.org]
Name: Email, dtype: object

In [104]:
print(df)

   Category       Date
0      Food 2025-01-05
1    Travel 2025-02-10
2      Food 2025-02-15
3  Shopping 2025-03-01
4    Travel 2025-03-10

In [95]:
df['Age']=df['Age'].astype(float)

In [97]:
import pandas as pd

df = pd.DataFrame({
    "Category": ["Food", "Travel", "Food", "Shopping", "Travel"],
    "Date": pd.to_datetime([
        "2025-01-05",
        "2025-02-10",
        "2025-02-15",
        "2025-03-01",
        "2025-03-10"
    ])
})

print(df)

   Category       Date
0      Food 2025-01-05
1    Travel 2025-02-10
2      Food 2025-02-15
3  Shopping 2025-03-01
4    Travel 2025-03-10

In [98]:
df['Category']=df['Category'].astype("category")

In [101]:
df['Date']=pd.to_datetime(df['Date'])

In [102]:
df.dtypes

Category          category
Date        datetime64[ns]
dtype: object

In [106]:
df['Age Group']=df['Age'].apply(lambda x:'Adult' if x>=18 else 'Minor')

In [107]:
print(df)

      Name  Age    City Age Group
0    Alice   25   Delhi     Adult
1      Bob   30  Mumbai     Adult
2  Charlie   35    Pune     Adult
3    Alice   25   Delhi     Adult
4      Bob   30  Mumbai     Adult

In [141]:
df.loc[len(df)]=['Hari','21','Bangalore']

In [110]:
print(df)

      Name Age       City Age Group
0    Alice  25      Delhi     Adult
1      Bob  30     Mumbai     Adult
2  Charlie  35       Pune     Adult
3    Alice  25      Delhi     Adult
4      Bob  30     Mumbai     Adult
5     Hari  21  Bangalore     Adult

In [127]:
import pandas as pd

df = pd.DataFrame({
    "Category": ["Food", "Travel", "Food", "Shopping"]
})

print(df)

   Category
0      Food
1    Travel
2      Food
3  Shopping

In [125]:
df['Category']=df['Category'].map({'Food':'1','Travel':'2','Shopping':'3'})

In [126]:
print(df)

  Category
0        1
1        2
2        1
3        3

In [131]:
print(df)

   Category
0       Foo
1      Trav
2       Foo
3  Shopping

In [130]:
df['Category']=df['Category'].replace({'Food':"Foo", "Travel":"Trav"})

In [137]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "Alice", "Bob"],
    "Age":  [25, 30, 35, 25, 30],
    "City": ["Delhi", "Mumbai", "Pune", "Delhi", "Mumbai"]
})

print(df)

      Name  Age    City
0    Alice   25   Delhi
1      Bob   30  Mumbai
2  Charlie   35    Pune
3    Alice   25   Delhi
4      Bob   30  Mumbai

In [150]:
df.sort_values(['Name','City'])

      Name Age       City
0    Alice  25      Delhi
3    Alice  25      Delhi
1      Bob  30     Mumbai
4      Bob  30     Mumbai
2  Charlie  35       Pune
6     Hari  21  Bangalore
5     Hari  21  bangalore

In [154]:
print(df)

      Name Age       City
0    Alice  25      Delhi
1      Bob  30     Mumbai
2  Charlie  35       Pune
3    Alice  25      Delhi
4      Bob  30     Mumbai
5     Hari  21  bangalore
6     Hari  21  Bangalore

In [151]:
df.index=['a','b','c','d','e','f','g']

In [153]:
df.reset_index(drop=True, inplace=True)

In [156]:
df.sort_index(ascending=False)

      Name Age       City
6     Hari  21  Bangalore
5     Hari  21  bangalore
4      Bob  30     Mumbai
3    Alice  25      Delhi
2  Charlie  35       Pune
1      Bob  30     Mumbai
0    Alice  25      Delhi

In [157]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Emma"],
    "Score": [95, 95, 88, 75, 75]
})

print(df)

      Name  Score
0    Alice     95
1      Bob     95
2  Charlie     88
3    David     75
4     Emma     75

In [162]:
df['Rank']=df['Score'].rank(ascending=False, method="dense")

In [163]:
print(df)

      Name  Score  Rank
0    Alice     95   1.0
1      Bob     95   1.0
2  Charlie     88   2.0
3    David     75   3.0
4     Emma     75   3.0

In [173]:
print(df)

   Rank  score     name
a   1.0     95    Alice
b   1.0     95      Bob
2   2.0     88  Charlie
3   3.0     75    David
4   3.0     75     Emma

In [167]:
df.rename(columns={"Name":"name",'Score':'score'}, inplace=True)

In [170]:
df.rename(index={0:'a',1:'b'}, inplace=True)

In [172]:
df=df[['Rank','score','name']]

In [176]:
cols=['score']+ [col for col in df.columns if col!='score']

In [177]:
df=df[cols]

In [178]:
print(df)

   score  Rank     name
a     95   1.0    Alice
b     95   1.0      Bob
2     88   2.0  Charlie
3     75   3.0    David
4     75   3.0     Emma

In [179]:
import pandas as pd
# Sample DataFrame
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Math': [85, 78, 92],
'Science': [90, 82, 89],
'English': [88, 85, 94]
}
df = pd.DataFrame(data)
# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [187]:
df=df.melt(id_vars=['Name'], value_vars=['Math','Science','English'], var_name='Subject', value_name='Marks')

In [188]:
print(df)

      Name  Subject  Marks
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [190]:
df.pivot(index='Name',columns='Subject', values='Marks')

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [191]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Alice", "Alice", "Alice", "Bob", "Bob"],
    "Subject": ["Math", "Math", "Science", "Math", "Math"],
    "Score": [85, 80, 90, 78, 82]
})

print(df)

    Name  Subject  Score
0  Alice     Math     85
1  Alice     Math     80
2  Alice  Science     90
3    Bob     Math     78
4    Bob     Math     82

In [197]:
df.pivot_table(index='Name',columns='Subject', values='Score', aggfunc="mean")

Subject  Math  Science
Name
Alice    82.5     90.0
Bob      80.0      NaN

In [199]:
df = pd.DataFrame({
"Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
"Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
"Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
"Salary": [85, 90, 78, 85, 92, 88, 75, 80],
"Age": [23, 25, 30, 22, 28, 26, 21, 27],
"JoinDate": pd.to_datetime([
"2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
"2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
])
})

In [216]:
df.groupby("Team").agg({
    'Salary': 'mean',
    'Age':'max'
})

      Salary  Age
Team
A       87.5   25
B       81.5   30
C       90.0   28
D       77.5   27

In [218]:
df['Team_Average']=df.groupby("Team")["Salary"]. transform("mean")

In [219]:
print(df)

  Department Team Gender  Salary  Age   JoinDate  Team_Average
0         HR    A      M      85   23 2020-01-10          87.5
1         HR    A      F      90   25 2020-02-15          87.5
2         IT    B      M      78   30 2021-03-20          81.5
3         IT    B      F      85   22 2021-04-10          81.5
4  Marketing    C      M      92   28 2020-05-30          90.0
5  Marketing    C      F      88   26 2020-06-25          90.0
6      Sales    D      M      75   21 2021-07-15          77.5
7      Sales    D      F      80   27 2021-08-01          77.5

In [222]:
df.groupby("Team").filter(lambda x: x['Salary'].mean() >80)

  Department Team Gender  Salary  Age   JoinDate  Team_Average
0         HR    A      M      85   23 2020-01-10          87.5
1         HR    A      F      90   25 2020-02-15          87.5
2         IT    B      M      78   30 2021-03-20          81.5
3         IT    B      F      85   22 2021-04-10          81.5
4  Marketing    C      M      92   28 2020-05-30          90.0
5  Marketing    C      F      88   26 2020-06-25          90.0

In [251]:
employees = pd.DataFrame({
"EmpID": [1, 2, 3],
"Name": ["Alice", "Bob", "Charlie"],
"DeptID": [10, 20, 30]
})
departments = pd.DataFrame({
"DeptID": [10, 20, 40],
"DeptName": ["HR", "Engineering", "Marketing"]
})

In [252]:
pd.merge(employees, departments, on="DeptID", how='right')

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [257]:
pd.merge(employees, departments, right_index=True, left_index=True, how='right')

   EmpID     Name  DeptID_x  DeptID_y     DeptName
0      1    Alice        10        10           HR
1      2      Bob        20        20  Engineering
2      3  Charlie        30        40    Marketing

In [228]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [229]:
print(df1)

    Name
0  Alice
1    Bob

In [230]:
print(df2)

      Name
0  Charlie
1    David

In [250]:
pd.merge([df1,df2], on="DeptID", how='right')

TypeError: merge() missing 1 required positional argument: 'right'

In [233]:
df1 = pd.DataFrame({"ID": [1, 2]})
df2 = pd.DataFrame({"Score": [90, 80]})

In [241]:
pd.concat([df1,df2])

TypeError: concat() got an unexpected keyword argument 'how'

In [239]:
df1.join(df2, how='right')

   ID  Score
0   1     90
1   2     80